""" Створення процесів за допомогою пакета concurrent

​Пакет concurrent.futures також реалізує API Executor для пулу процесів у 
класі ProcessPoolExecutor.
https://docs.python.org/3/library/concurrent.futures.html#processpoolexecutor

Основні можливості обмежені API Executor. Зручно використовувати ProcessPoolExecutor 
там, де потрібно виконати CPU-bound завдання в async коді та реалізовано саме для 
підтримки виконання блокуючих CPU-bound завдань в async застосунках (з async ми 
познайомимося в "Модуль 5: Асинхронне програмування в Python").

Зараз поки що розглянемо приклад виконання CPU-bound завдання: """

import concurrent.futures
import math

# Список великих чисел для перевірки на простоту (деякі з них є простими, а деякі ні)
PRIMES = [
    112272535095293,
    112582705942171,
    112272535095293,
    115280095190773,
    115797848077099,
    1099726899285419]


def is_prime(n):
    """Перевіряє, чи є число n простим."""
    if n < 2:
        return False
    if n == 2:
        return True
    if n % 2 == 0:
        return False
# Перевіряємо дільники від 3 до квадратного кореня з n, пропускаючи парні числа,
# оскільки вони вже були перевірені. Квадратний корінь з n визначає верхню межу
# для перевірки дільників, оскільки якщо n має дільник більший за свій квадратний
# корінь, то він обов'язково має менший дільник, який вже був перевірений.
    sqrt_n = int(math.floor(math.sqrt(n)))
# Цикл починається з 3 і перевіряє кожне непарне число до sqrt_n. Якщо n ділиться
# на будь-яке з цих чисел без остачі, то n не є простим. Якщо ж цикл завершується
# без знаходження дільника, то n є простим числом.
    for i in range(3, sqrt_n + 1, 2):
        if n % i == 0:
            return False
    return True


if __name__ == '__main__':
# Створюємо пул процесів з 4 робочими процесами. Використовуємо метод map для застосування
# функції is_prime до кожного числа в списку PRIMES. Результати поверта ються у вигляді
# ітератора, який ми проходимо за допомогою zip, щоб отримати відповідні числа та їх статус
# простоти. Результат виводиться на екран.
    with concurrent.futures.ProcessPoolExecutor(4) as executor:
        for number, prime in zip(PRIMES, executor.map(is_prime, PRIMES)):
            print('%d is prime: %s' % (number, prime))

# Цей код для пошуку простих чисел виконується у чотирьох процесах, які обробляють
# завдання паралельно. Результат виконання показує, які числа є простими, а які ні.
# Результат виконання:
# 112272535095293 is prime: True
# 112582705942171 is prime: True
# 112272535095293 is prime: True
# 115280095190773 is prime: True
# 115797848077099 is prime: True
# 1099726899285419 is prime: False
